Revit 2027 API
ColumnAttachment.SetJustification Method
 Setter of ColumnAttachmentJustification
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetJustification(
	ColumnAttachmentJustification justification
)
Public Sub SetJustification (
	justification As ColumnAttachmentJustification
)
public:
void SetJustification(
	ColumnAttachmentJustification justification
)
member SetJustification :
        justification : ColumnAttachmentJustification -> unit
Parameters
justification ColumnAttachmentJustification
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ColumnAttachment Class
Autodesk.Revit.DB Namespace